Repository: Alittlefly/FSVideoEditor
Catalog: *.lproj/Localizable.strings
Languages: ar, tr, zh_hans

# NoNetWork
source: Connection failed! Please check your internet settings
ar: حالياً لا توجد شبكة! الرجاء التأكد من إعدادات الإنترنت
tr: Şu anda bağlantı yok, lütfen internet ayarlarınızı kontrol edin!
zh_hans: 当前没有网络，请检查网络设置

# NotWifi
source: No wifi connection, continue using mobile network?
ar: أنت الآن غير متصل بشبكة وايفاي، هل تريد الإستمرار في التحميل؟
tr: Wi-fi bağlantısı yok, mobil veri kullanarak devam etmek istiyor musun?
zh_hans: 当前为非wifi环境, 是否要使用移动网络上传？

source: Account
ar: الحساب
tr: Hesap
zh_hans: 账号

source: Password
ar: كلمة السر
tr: Şifre
zh_hans: 密码

source: Login
ar: تسجيل دخول
tr: Giriş yap
zh_hans: 登录

# BadPassword
source: Incorrect Password
ar: كلمة السر غير صحيحة
tr: Şifre hatalı
zh_hans: 密码错误

source: Login Failed
ar: فشل في تسجيل الدخول
tr: Giriş yapılamadı
zh_hans: 登录失败

source: Log Out
ar: خروج
tr: Çıkış
zh_hans: 退出登录

# leastTime
source: Video length should be 5 seconds at least
ar: يجب أن تكون مدة الفيديو 3 ثواني على الأقل لتتمكن من النشر
zh_hans: 选择的视频不能少于5s

# UploadVideo
source: Upload
ar: تحميل
tr: Video yükle
zh_hans: 上传视频

# ChooseMusic
source: Music
ar: موسيقى
tr: Müzik seç
zh_hans: 选择音乐

source: Record
ar: سجل فيديو
tr: Kayda Başla
zh_hans: 直接开拍

source: Hot Music
ar: أجمل الأغاني
tr: Popüler Müzik
zh_hans: 热门歌曲

# likeMusic
source: My favorites
ar: مفضلاتي
tr: Favorilerim
zh_hans: 我的收藏

# RecordNow
source: Use the music and record
ar: البدء بتسجيل الفيديو
tr: Bu müzikle video çek
zh_hans: 确定使用并开拍

source: Loading...
ar: جاري التحميل
tr: Yükleniyor...
zh_hans: 加载中…

source: Cancel
ar: إلغاء
tr: İptal
zh_hans: 取消

source: Search music
ar: ابحث عن موسيقى
tr: Müzik ara
zh_hans: 搜索歌曲名称

# VideoLengthTip
source: Video should be more than (0)s
ar: يجب أن تكون مدة الفيديو (0) ثواني على الأقل لتتمكن من النشر
tr: Video en az (0) sn olmalı
zh_hans: 选择的视频不能少于5s

source: Edit
ar: تعديل
tr: Değiştir
zh_hans: 编辑

source: Volume
ar: مستوى الصوت
tr: Ses
zh_hans: 音量

source: Effects
ar: مؤثرات خاصة
tr: Efekt
zh_hans: 特效

# EnterTitle
source: Write Something
ar: اكتب عنوان
tr: Bir şeyler yaz...
zh_hans: 输入标题

# AddHashtag
source: Start Challenge
ar: إضافة هاشتاج
tr: Challenge ekle
zh_hans: 添加挑战

source: Save in Gallery
ar: حفظ في الأستوديو
tr: Galeriye kaydet
zh_hans: 同时保存到相册

# CanlceVideo
source: If continue all effects will be deleted
ar: الفيديو المحمل أو الفيديو القديم لا يدعم استمرار التصوير
tr: Devam edersen uyguladığın efektler silinecek
zh_hans: 本地上传或旧版本的视频不支持继续拍摄

# GiveUpEdit
source: Do you want to exit?
ar: هل تريد حذف التعديلات?
tr: Çıkmak istiyor musun?
zh_hans: 是否放弃编辑?

# Draft
source: Draft Box
ar: حفظ في الذاكرة
tr: Taslaklar
zh_hans: 草稿

source: Upload
ar: نشر
tr: Paylaş
zh_hans: 发布

# UploadFailed
source: Uploading Failed
ar: فشل النشر
tr: Paylaşım başarısız
zh_hans: 发布失败

source: Uploading…
ar: جاري التحميل ....
tr: Yükleniyor...
zh_hans: 上传中...

# UploadSecceed
source: Uploaded
ar: تم النشر
tr: Paylaşım başarılı
zh_hans: 发布成功

# CancelRecording
source: Do you want to cancel recording?
ar: هل تريد إلغاء التسجيل الحالي؟
tr: Kaydı yarıda bırakmak istiyor musun?
zh_hans: 是否放弃当前录制？

# CancelRecorded
source: Yes
ar: إلغاء الأمر
tr: Evet
zh_hans: 放弃

source: Original Voice
ar: الصوت الأصلي للفيديو
tr: Orijinal Ses
zh_hans: 视频原声

# CancelEditing
source: Do you want to cancel editing?
ar: هل تريد إلغاء تسجيل الفيديو؟
tr: Video kaydını iptal etmek istiyor musun?
zh_hans: 是否放弃拍摄?

# CancelEditWarning
source: If continue all effects will be deleted, continue?
ar: إذا استمريت بالعودة سيتم حذف جميع الفلاتر، هل تريد الإستمرار؟
tr: Tüm efektler kaybolacak, devam etmek istiyor musun?
zh_hans: 继续拍摄之前的特效会被清空,是否继续

source: Done
ar: تأكيد
tr: Tamamlandı
zh_hans: 完成

source: Save
ar: حفظ
tr: Kaydet
zh_hans: 保存

# Filters
source: Special Effects
ar: فلاتر الفيديو
tr: Genel Efekt
zh_hans: 滤镜特效

# Timeline
source: Time Effects
ar: فلاتر الزمن
tr: Zaman Efekti
zh_hans: 时间特效

# Magic
source: Ghost
ar: فلتر سحري
tr: Ruhsal
zh_hans: 灵魂出窍

# Vibrating
source: Tremble
ar: فلتر هزاز
tr: Titreşim
zh_hans: 抖动

source: Repeat
ar: تكرار الحركة
tr: Tekrar
zh_hans: 反复

source: Reverse
ar: عكس الزمن
tr: Geri Sar
zh_hans: 时光倒流

# NoFilter
source: Normal
ar: بدون فلتر
tr: Filtresiz
zh_hans: 无

# ChooseEffectsTip
source: Press to choose time effects
ar: اضغط لاختيار فلاتر الزمن
tr: Zaman efekti seçmek için tıkla
zh_hans: 点击选择时间特效

source: Slow Motion
ar: حركة بطيئة
tr: Ağır Çekim
zh_hans: 慢动作

# Delete
source: Undo
ar: مسح
tr: İptal
zh_hans: 撤销

# AddFilterTip
source: Long press to add effects
ar: استمر بالضغط لتحدد المكان الذي تريد إضافة فلتر له
tr: Efekt uygulayacağın yeri seç ve basılı tut
zh_hans: 选择位置后,按住使用特效

# EraseEffectsTip
source: Do you want to clear all saved effects?
ar: متأكد أنك تريد مسح التأثيرات السابقة؟
tr: Uyguladığın tüm efektleri silmek istiyor musun?
zh_hans: 是否清除已添加的特效？

# Erase
source: Clear
ar: مسح
tr: Sil
zh_hans: 清除

# LongPress
source: Long press to record, release to pause
ar: اضغط مطولاً للتسجيل
tr: Kayıt için basılı tut
zh_hans: 按住开始拍摄,松开暂停

# VerySlow
source: Slower
ar: بطئ جداً
tr: Çok Yavaş
zh_hans: 极慢

source: Slow
ar: بطئ
tr: Yavaş
zh_hans: 慢

source: Normal
ar: طبيعي
tr: Standart
zh_hans: 标准

source: Fast
ar: سريع
tr: Hızlı
zh_hans: 快

# VeryFast
source: Faster
ar: سريع جداً
tr: Çok Hızlı
zh_hans: 极快

source: Countdown
ar: العد التنازلي
tr: Geri Sayım
zh_hans: 倒计时

# ColorFilter
source: Filter
ar: فلتر اللون
tr: Filtre
zh_hans: 滤镜

# BW
source: Black & White
ar: ظل
tr: SB
zh_hans: 黑白

# Sweetie
source: Sweet
ar: رومنسي
tr: Sempatik
zh_hans: 甜美

source: Lomo
ar: كوول

source: Classic
ar: كلاسيكي
tr: Parlak
zh_hans: 经典

# IceBlue
source: Blueish
ar: سماوي
tr: Maviş
zh_hans: 蓝调

# Classical
source: Light
ar: فاتح
tr: Mor
zh_hans: 紫霞

# RisingSun
source: Morning
ar: Rising Sun
tr: Sabah
zh_hans: 朝阳

# WarmTea
source: Warm
ar: مشع
tr: Ilık
zh_hans: 暖茶

# TheGoldenTimes
source: Old Times
ar: باهت
tr: Yıllar
zh_hans: 流金岁月

# Yummy
source: Milky
ar: خافت
tr: Sütlü Çay
zh_hans: 焦糖奶茶

source: Beautify On
ar: فتح تحسينات الصورة
tr: Güzellik
zh_hans: 美颜开

source: Beautify Off
ar: غلق تحسينات الصورة
tr: Güzellik
zh_hans: 美颜关

source: Cut Music
ar: قص الأغاني
tr: Müzik
zh_hans: 剪音乐

# BeautifyOnTip
source: Beautify Mode On
ar: تم فتح تحسينات الصورة
tr: Güzellik Modu Açık
zh_hans: 美颜已开启

# BeautifyOffTip
source: Beautify Mode Off
ar: تم غلق تحسينات الصورة
tr: Güzellik Modu Kapalı
zh_hans: 美颜已关闭

# PressToRecord
source: Long press on the green button to record
ar: استمر بالضغط على الزر الأخضر للتسجيل
tr: Yeşil butona basılı tutarak kayda başla
zh_hans: 按住下方绿色按钮开始拍摄

# DeleteVideoTip
source: Do you want to delete the previouse video?
ar: هل تريد حذف الفيديو؟
tr: Önceki videoyu silmek istiyor musun?
zh_hans: 确定删除上一段视频?

source: Confirm
ar: تأكيد
tr: Tamam
zh_hans: 确定

# EditMusicTip
source: Slide left and right to edit music
ar: حرك المؤشر يميناً و يساراً لقص الموسيقى كما تريد
tr: Sağa ve sola kaydırarak müziği ayarla
zh_hans: 左右拖动声谱以剪取音乐

# MusicStartTime
source: Music starts at (0)
ar: الوقت : (0)
tr: Müzik (0)'da başlar
zh_hans: 当前从(0)开始

source: Original
ar: الصوت الأصلي
tr: Orijinal
zh_hans: 原声

source: Music
ar: اضف موسيقى
tr: Müzik
zh_hans: 配乐

# ChoseVideoTime
source: You chose (0) seconds
ar: تم اختيار (0) ثانية من الفيديو
tr: (0) saniye seçtin
zh_hans: 已选取(0)s

source: Processing…
ar: جاري المعالجة...
tr: Şu anda halloluyor...
zh_hans: 奋力处理中

# EnterChallenge
source: Enter challenge content
ar: ما هو التحدي الذي ستقدمه؟
tr: Video konusunu gir
zh_hans: 输入挑战内容

# HotChallenges
source: Recommended Challenges
ar: تحديات مقترحة
tr: Önerilen Konular
zh_hans: 热门挑战推荐

# ChallengePeopleCount
source: (0) people did this challenge
ar: (0)المشاركين في التحدي
tr: (x) kişi bu konuda video çekti
zh_hans: (0)人参与挑战

# ChallengeDescribe
source: Briefly describe your challenge
ar: اوصف التحدي الذي ستقدمه باختصار
tr: Konu içeriğine dair kısaca bilgi ver
zh_hans: 简单描述一下你的挑战

# MaxWordsCount
source: Max (0) letters
ar: في حدود (0) حرف
tr: Maksimum (0) harf
zh_hans: 限定(0)字

# MaxLetterLimit
source: You have exceeded the maximum letter limit
ar: لقد تجاوزت عدد الحروف المسموح بها
tr: Kelime limitini aştınız
zh_hans: 已超出最大字数限制

# TakePhotoAgain
source: Take another video
ar: صور فيديو آخر
tr: Bir tane daha çek
zh_hans: 再拍一张

# OnlyYouCanSee
source: Drafts are only visible to you
ar: لا يمكن لغيرك رؤية صندوق الحفظ
tr: Taslakları sadece sen görebilirsin
zh_hans: 只有你自己可见

# NoTitle
source: Empty title
ar: لا يوجد عنوان
tr: Başlık yok
zh_hans: 暂时无标题

# NoTopic
source: You haven't started a challenge yet
ar: لا يوجد موضوع
tr: Henüz bir challange başlatmadın
zh_hans: 暂时无话题

# DraftTitle
source: Draft Box
ar: حفظ في المسودة
tr: Taslaklar
zh_hans: 草稿箱

# deletaAll
source: Delete all
ar: حذف الكل
tr: Tümünü sil
zh_hans: 清空

# deleteAlert
source: Do you want to delete it?
ar: هل تريد الحذف؟
tr: Silmek istediğine emin misin?
zh_hans: 你确定删除该信息

# deleteAllAlert
source: Do you want to delete all of them?
ar: هل تريد أن تترك هذا الجزء بلا محتوى؟
tr: Tümünü silmek istiyor musun?
zh_hans: 你确认删除所有信息吗

# MessageCancel
source: Cancel
ar: إلغاء
tr: İptal
zh_hans: 取消

# MessageOK
source: Yes
ar: تأكيد
tr: Evet
zh_hans: 确认

# emptyDraft
source: Oops! No data found
ar: خطأ فى التحميل
tr: Taslaklarda video yok
zh_hans: 空数据

# xsignal
source: X Ray
ar: إشارة X
zh_hans: X信号

# VideoTimeMaxTip
source: You can't add more clips unless you delete one first.
ar: 拍满了，请删除一段视频后再拍
tr: Hafıza dolu, lütfen bir video silip yeniden deneyin!
zh_hans: 拍满了，请删除一段视频后再拍

source: Mirror
tr: Ayna

# huanjue
source: Illusion
tr: İllüzyon

# MoreTag
source: more
tr: daha
